#### [`repos`] Terraform Plan 📖`success`



<details><summary>Show Plan</summary>

```tf
data.github_team.cdktn-team-cdk-terrain: Reading...
data.github_team.cdktn-team-cdk-terrain: Read complete after 5s [id=15746607]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-alert-prs-slack-webhook-url_3DEE0CCC will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-alert-prs-slack-webhook-url_3DEE0CCC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-id-alias-PROJEN_APP_ID_03A7C388 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-id-alias-PROJEN_APP_ID_03A7C388" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "PROJEN_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-id_F3F7DE54 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-id_F3F7DE54" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "GH_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_B467195A will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_B467195A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "PROJEN_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-private-key_728C9E43 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-private-key_728C9E43" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "GH_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_23459056 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_23459056" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_34157FC4 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_34157FC4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-token_990262B8 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-token_990262B8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-npm-token_CBEF1300 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-npm-token_CBEF1300" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-twine-password_F9423D0A will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-twine-password_F9423D0A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-twine-username_087C8662 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-twine-username_087C8662" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.cdktn-provider-azurerm_repository-setup_main-protection_56EA72C4 will be created
  + resource "github_branch_protection" "cdktn-provider-azurerm_repository-setup_main-protection_56EA72C4" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktn-provider-azurerm"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-go",
              + "package-js",
              + "package-python",
            ]
          + strict   = false
        }
    }

  # github_branch_protection.cdktn-provider-project_repository-setup_main-protection_EF7C5990 will be created
  + resource "github_branch_protection" "cdktn-provider-project_repository-setup_main-protection_EF7C5990" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktn-provider-project"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-js",
            ]
          + strict   = false
        }
    }

  # github_issue_label.cdktn-provider-azurerm-go_repository-setup_auto-approve-label_7F9E783C will be created
  + resource "github_issue_label" "cdktn-provider-azurerm-go_repository-setup_auto-approve-label_7F9E783C" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-azurerm-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azurerm-go_repository-setup_automerge-label_BD7EA5B4 will be created
  + resource "github_issue_label" "cdktn-provider-azurerm-go_repository-setup_automerge-label_BD7EA5B4" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-azurerm-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azurerm-go_repository-setup_no-auto-close-label_16A58BEB will be created
  + resource "github_issue_label" "cdktn-provider-azurerm-go_repository-setup_no-auto-close-label_16A58BEB" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-azurerm-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azurerm_repository-setup_auto-approve-label_7C4C571A will be created
  + resource "github_issue_label" "cdktn-provider-azurerm_repository-setup_auto-approve-label_7C4C571A" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-azurerm"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azurerm_repository-setup_automerge-label_954A59CE will be created
  + resource "github_issue_label" "cdktn-provider-azurerm_repository-setup_automerge-label_954A59CE" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-azurerm"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azurerm_repository-setup_no-auto-close-label_28EF6DBE will be created
  + resource "github_issue_label" "cdktn-provider-azurerm_repository-setup_no-auto-close-label_28EF6DBE" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-azurerm"
      + url        = (known after apply)
    }

  # github_repository.cdktn-provider-azurerm-go_repo_C5B858ED will be created
  + resource "github_repository" "cdktn-provider-azurerm-go_repo_C5B858ED" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "CDK for Terraform Go provider bindings for azurerm."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + homepage_url                = "https://cdk.tf"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "cdktn-provider-azurerm-go"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "PR_BODY"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "azurerm",
          + "cdk",
          + "cdktf",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = false
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.cdktn-provider-azurerm_repo_25F8C0DE will be created
  + resource "github_repository" "cdktn-provider-azurerm_repo_25F8C0DE" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Prebuilt Terraform CDK (cdktf) provider for azurerm."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + homepage_url                = "https://cdk.tf"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "cdktn-provider-azurerm"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "PR_BODY"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "azurerm",
          + "cdk",
          + "cdktf",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository_dependabot_security_updates.cdktn-provider-azurerm_dependabot-security_50DE6661 will be created
  + resource "github_repository_dependabot_security_updates" "cdktn-provider-azurerm_dependabot-security_50DE6661" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "cdktn-provider-azurerm"
    }

  # github_repository_webhook.cdktn-provider-azurerm-go_repository-setup_slack-webhook_20010394 will be created
  + resource "github_repository_webhook" "cdktn-provider-azurerm-go_repository-setup_slack-webhook_20010394" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-azurerm-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktn-provider-azurerm_repository-setup_slack-webhook_84ED2A61 will be created
  + resource "github_repository_webhook" "cdktn-provider-azurerm_repository-setup_slack-webhook_84ED2A61" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-azurerm"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.cdktn-provider-azurerm-go_repository-setup_managing-team_87A1B2C5 will be created
  + resource "github_team_repository" "cdktn-provider-azurerm-go_repository-setup_managing-team_87A1B2C5" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-azurerm-go"
      + team_id    = "15746607"
    }

  # github_team_repository.cdktn-provider-azurerm_repository-setup_managing-team_DE2678CC will be created
  + resource "github_team_repository" "cdktn-provider-azurerm_repository-setup_managing-team_DE2678CC" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-azurerm"
      + team_id    = "15746607"
    }

Plan: 26 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + providerRepos   = [
      + "github_repository.cdktn-provider-archive_repo_7B884DD9.ssh_clone_url",
      + "github_repository.cdktn-provider-aws_repo_45EAAAF4.ssh_clone_url",
      + "github_repository.cdktn-provider-azurerm_repo_25F8C0DE.ssh_clone_url",
      + "github_repository.cdktn-provider-cloudinit_repo_8DDE9C9A.ssh_clone_url",
      + "github_repository.cdktn-provider-docker_repo_B5F1E60F.ssh_clone_url",
      + "github_repository.cdktn-provider-external_repo_1F85962F.ssh_clone_url",
      + "github_repository.cdktn-provider-github_repo_4B89F268.ssh_clone_url",
      + "github_repository.cdktn-provider-kubernetes_repo_A94DB71E.ssh_clone_url",
      + "github_repository.cdktn-provider-local_repo_5CE00778.ssh_clone_url",
      + "github_repository.cdktn-provider-null_repo_41CFF515.ssh_clone_url",
      + "github_repository.cdktn-provider-random_repo_D20F5E27.ssh_clone_url",
      + "github_repository.cdktn-provider-time_repo_3B2224F9.ssh_clone_url",
      + "github_repository.cdktn-provider-tls_repo_49C93FD1.ssh_clone_url",
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @so0k, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*